---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PipingFailures.PartNotFoundInRoutingPreferenceWarning
source: html/f09863b3-e48b-b548-c42f-56299b1b52a3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PipingFailures.PartNotFoundInRoutingPreferenceWarning Property

"%1s is not found. Please review the routing preference of %2s."

## Syntax (C#)
```csharp
public static FailureDefinitionId PartNotFoundInRoutingPreferenceWarning { get; }
```